openfoam2/OpenFOAM-2.3.x/tutorials/multiphase/cavitatingFoam/les/throttle/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

mul             mul [ 1 -1 -1 0 0 ] 0.0065;

muv             muv [ 1 -1 -1 0 0 ] 5.953e-06;

phases (vapour water);

water
{
    transportModel  Newtonian;
    nu              nu [ 0 2 -1 0 0 0 0 ] 7.831e-06;
    rho             rho [ 1 -3 0 0 0 0 0 ] 830;
    CrossPowerLawCoeffs
    {
        nu0             nu0 [ 0 2 -1 0 0 0 0 ] -999;
        nuInf           nuInf [ 0 2 -1 0 0 0 0 ] -999;
        m               m [ 0 0 1 0 0 0 0 ] -999;
        n               n [ 0 0 0 0 0 0 0 ] -999;
    }

    BirdCarreauCoeffs
    {
        nu0             nu0 [ 0 2 -1 0 0 0 0 ] -999;
        nuInf           nuInf [ 0 2 -1 0 0 0 0 ] -999;
        k               k [ 0 0 1 0 0 0 0 ] -999;
        n               n [ 0 0 0 0 0 0 0 ] -999;
    }
}

vapour
{
    transportModel  Newtonian;
    nu              nu [ 0 2 -1 0 0 0 0 ] 4.252e-05;
    rho             rho [ 1 -3 0 0 0 0 0 ] 0.14;
    CrossPowerLawCoeffs
    {
        nu0             nu0 [ 0 2 -1 0 0 0 0 ] -999;
        nuInf           nuInf [ 0 2 -1 0 0 0 0 ] -999;
        m               m [ 0 0 1 0 0 0 0 ] -999;
        n               n [ 0 0 0 0 0 0 0 ] -999;
    }

    BirdCarreauCoeffs
    {
        nu0             nu0 [ 0 2 -1 0 0 0 0 ] -999;
        nuInf           nuInf [ 0 2 -1 0 0 0 0 ] -999;
        k               k [ 0 0 1 0 0 0 0 ] -999;
        n               n [ 0 0 0 0 0 0 0 ] -999;
    }
}


// ************************************************************************* //
